abdallah-shehawey/V2X-Collision-Avoidance/V2V-STM32/Src/GPIO_prog.c
/**
 ******************************************************************************
 * @file    GPIO_prog.c
 * @author  Abdallah Abdelmoemen Shehawey
 * @brief   Implementation of the GPIO driver — the general-purpose I/O ports.
 * @ingroup mcal_gpio
 ******************************************************************************
 */

#include <stdint.h>
#include "../Inc/Drivers/LIB/STM32F446xx.h"

#include "../Inc/Drivers/LIB/STD_MACROS.h"
#include "../Inc/Drivers/LIB/ErrTypes.h"

#include "../Inc/Drivers/MCAL/GPIO/GPIO_interface.h"
#include "../Inc/Drivers/MCAL/GPIO/GPIO_private.h"
#include "../Inc/Drivers/MCAL/GPIO/GPIO_config.h"

/* Array of GPIO port register definitions for easy access */
/**
 * @brief Maps a @ref GPIO_Port_t onto the port's register block.
 * @note The order must match @ref GPIO_Port_t exactly — the enum indexes straight
 *       into this table.
 */
static GPIO_REGDEF_t *GPIO_Port[GPIO_PORT_COUNT] = { MGPIOA, MGPIOB, MGPIOC, MGPIOD, MGPIOE, MGPIOF, MGPIOG, MGPIOH };

/*=================================================================================================================*/
/*
 * @brief Initializes GPIO pin configuration using array-based port access
 * @param PinConfig[in]: Pointer to pin configuration structure containing:
 *                      - Port: Selected GPIO port index (PORTA to PORTH)
 *                      - PinNum: Selected pin number (PIN0 to PIN15)
 *                      - Mode: Pin mode (INPUT, OUTPUT, ALTFN, ANALOG)
 *                      - Otype: Output type (PUSH_PULL, OPEN_DRAIN)
 *                      - Speed: Output speed (LOW_SPEED, MEDIUM_SPEED, HIGH_SPEED, VERY_HIGH_SPEED)
 *                      - PullType: Pull-up/Pull-down configuration (NO_PULL, PULL_UP, PULL_DOWN)
 *                      - AlternateFunction: Alternate function number if Mode is ALTFN (AF0 to AF15)
 * @retval ErrorState_t OK if configuration successful, NOK if invalid parameters, NULL_POINTER if invalid ptr
 */
ErrorState_t GPIO_enumPinInit(const GPIO_PinConfig_t *PinConfig)
{
  ErrorState_t Local_u8ErrorState = OK;

  if (PinConfig != NULL)
  {
    /* Check if port and pin numbers are valid */
    if ((PinConfig->Port <= GPIO_PORTH) &&
        (PinConfig->PinNum <= GPIO_PIN15) &&
        (PinConfig->Mode <= GPIO_ANALOG) &&
        (PinConfig->Otype <= GPIO_OPEN_DRAIN) &&
        (PinConfig->Speed <= GPIO_VERY_HIGH_SPEED) &&
        (PinConfig->PullType <= GPIO_PULL_DOWN) &&
        (PinConfig->AlternateFunction <= GPIO_AF15))
    {
      /* Configure pin mode (Input/Output/Alternate Function/Analog) */
      (GPIO_Port[PinConfig->Port]->MODER) &= ~(MODER_MASK << ((PinConfig->PinNum) * MODER_PIN_ACCESS));
      (GPIO_Port[PinConfig->Port]->MODER) |= (PinConfig->Mode << ((PinConfig->PinNum) * MODER_PIN_ACCESS));
      //_______________________________________________________________________________________________________________//
      /* Set Pull up or Pull down or No pull */
      // if the pin mode is analog, HW will ignore the pull type
      (GPIO_Port[PinConfig->Port]->PUPDR) &= ~(PUPDR_MASK << ((PinConfig->PinNum) * PUPDR_PIN_ACCESS));
      (GPIO_Port[PinConfig->Port]->PUPDR) |= (PinConfig->PullType << ((PinConfig->PinNum) * PUPDR_PIN_ACCESS));
      //_______________________________________________________________________________________________________________//
      /* select output type and output speed in case of general purpose output or alternate function */
      if ((PinConfig->Mode == GPIO_OUTPUT) || (PinConfig->Mode == GPIO_ALTFN))
      {
        /* Set output type : push pull or open drain */
        GPIO_Port[PinConfig->Port]->OTYPER &= ~(OTYPER_MASK << PinConfig->PinNum);
        GPIO_Port[PinConfig->Port]->OTYPER |= (PinConfig->Otype << PinConfig->PinNum);
        //_______________________________________________________________________________________________________________//
        /* Configure output speed : low, medium, high, fast */
        GPIO_Port[PinConfig->Port]->OSPEEDR &= ~(OSPEEDR_MASK << (PinConfig->PinNum * OSPEEDR_PIN_ACCESS));
        GPIO_Port[PinConfig->Port]->OSPEEDR |= (PinConfig->Speed << (PinConfig->PinNum * OSPEEDR_PIN_ACCESS));
        //_______________________________________________________________________________________________________________//
        /* select the pin alternate function */
        if (PinConfig->Mode == GPIO_ALTFN)
        {
          GPIO_Port[PinConfig->Port]->AFR[(PinConfig->PinNum) / AFR_PIN_SHIFT] &= ~(AFR_MASK << (((PinConfig->PinNum) % 8u) * AFR_PIN_ACCESS));
          GPIO_Port[PinConfig->Port]->AFR[(PinConfig->PinNum) / AFR_PIN_SHIFT] |= (PinConfig->AlternateFunction << (((PinConfig->PinNum) % 8u) * AFR_PIN_ACCESS));
        }
      }
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
/*
 * @brief Initializes GPIO low nibble configuration
 * @param LowNibbleConfig[in]: Pointer to low nibble configuration structure
 * @retval GPIO_ErrorState GPIO_OK if successful, GPIO_NOK if error
 */
ErrorState_t GPIO_enumLowNibbleInit(GPIO_LowNibbleConfig_t *LowNibbleConfig)
{
  ErrorState_t Local_u8ErrorState = OK;
  uint8_t      Local_u8Counter;
  uint8_t      Local_u8CopyStartPin;

  if (LowNibbleConfig != NULL)
  { /* Check if port and configuration parameters are valid */
    if ((LowNibbleConfig->Port <= GPIO_PORTH) &&
        (LowNibbleConfig->StartPin <= GPIO_PIN15) &&
        (LowNibbleConfig->Mode <= GPIO_OUTPUT) &&
        (LowNibbleConfig->Otype <= GPIO_OPEN_DRAIN) &&
        (LowNibbleConfig->Speed <= GPIO_VERY_HIGH_SPEED) &&
        (LowNibbleConfig->PullType <= GPIO_PULL_DOWN))
    {
      Local_u8CopyStartPin = LowNibbleConfig->StartPin;
      /* Configure the 8 pins */
      for (Local_u8Counter = GPIO_PIN0; Local_u8Counter <= GPIO_PIN3; Local_u8Counter++)
      {
        LowNibbleConfig->StartPin = Local_u8Counter;
        GPIO_enumPinInit((GPIO_PinConfig_t *)LowNibbleConfig); //Error when casting removed
      }
      LowNibbleConfig->StartPin = Local_u8CopyStartPin;
      UNUSED(Local_u8CopyStartPin);
      UNUSED(Local_u8Counter);
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
/*
 * @brief Initializes GPIO pin configuration
 * @param PinConfig[in]: Pointer to pin configuration structure
 * @retval GPIO_ErrorState GPIO_OK if successful, GPIO_NOK if error
 */
ErrorState_t GPIO_enumHighNibbleInit(GPIO_HighNibbleConfig_t *HighNibbleConfig)
{
  ErrorState_t Local_u8ErrorState = OK;
  uint8_t      Local_u8Counter;
  uint8_t      Local_u8CopyStartPin;

