abdallah-shehawey/V2X-Collision-Avoidance/V2V-STM32/Src/GPIO_prog.c
  if (HighNibbleConfig != NULL)
  { /* Check if port and configuration parameters are valid */
    if ((HighNibbleConfig->Port <= GPIO_PORTH) &&
        (HighNibbleConfig->StartPin <= GPIO_PIN15) &&
        (HighNibbleConfig->Mode <= GPIO_OUTPUT) &&
        (HighNibbleConfig->Otype <= GPIO_OPEN_DRAIN) &&
        (HighNibbleConfig->Speed <= GPIO_VERY_HIGH_SPEED) &&
        (HighNibbleConfig->PullType <= GPIO_PULL_DOWN))
    {
      Local_u8CopyStartPin = HighNibbleConfig->StartPin;
      /* Configure the 8 pins */
      for (Local_u8Counter = GPIO_PIN4; Local_u8Counter <= GPIO_PIN7; Local_u8Counter++)
      {
        HighNibbleConfig->StartPin = Local_u8Counter;
        GPIO_enumPinInit((GPIO_PinConfig_t *)HighNibbleConfig); //Error when casting removed
      }
      HighNibbleConfig->StartPin = Local_u8CopyStartPin;
      UNUSED(Local_u8CopyStartPin);
      UNUSED(Local_u8Counter);
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
/*
 * @brief Initializes GPIO pin configuration
 * @param PinConfig[in]: Pointer to pin configuration structure
 * @retval GPIO_ErrorState GPIO_OK if successful, GPIO_NOK if error
 */
ErrorState_t GPIO_enumByteInit(GPIO_ByteConfig_t *ByteConfig)
{
  ErrorState_t Local_u8ErrorState = OK;
  uint8_t      Local_u8Counter;
  uint8_t      Local_u8CopyStartPin;

  if (ByteConfig != NULL)
  { /* Check if port and configuration parameters are valid */
    if ((ByteConfig->Port <= GPIO_PORTH) &&
        (ByteConfig->StartPin <= GPIO_PIN15) &&
        (ByteConfig->Mode <= GPIO_OUTPUT) &&
        (ByteConfig->Otype <= GPIO_OPEN_DRAIN) &&
        (ByteConfig->Speed <= GPIO_VERY_HIGH_SPEED) &&
        (ByteConfig->PullType <= GPIO_PULL_DOWN))
    {
      Local_u8CopyStartPin = ByteConfig->StartPin;
      /* Configure the 8 pins */
      for (Local_u8Counter = GPIO_PIN0; Local_u8Counter <= GPIO_PIN7; Local_u8Counter++)
      {
        ByteConfig->StartPin = Local_u8Counter;
        GPIO_enumPinInit((GPIO_PinConfig_t *)ByteConfig); //Error when casting removed
      }
      ByteConfig->StartPin = Local_u8CopyStartPin;
      UNUSED(Local_u8CopyStartPin);
      UNUSED(Local_u8Counter);
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
/*
 * @brief Initializes GPIO pin configuration
 * @param PinConfig[in]: Pointer to pin configuration structure
 * @retval GPIO_ErrorState GPIO_OK if successful, GPIO_NOK if error
 */
ErrorState_t GPIO_enumHalfPortInit(GPIO_HalfPortConfig_t *HalfPortConfig)
{
  ErrorState_t Local_u8ErrorState = OK;
  uint8_t      Local_u8Counter;
  uint8_t      Local_u8CopyStartPin;

  if (HalfPortConfig != NULL)
  { /* Check if port and configuration parameters are valid */
    if ((HalfPortConfig->Port <= GPIO_PORTH) &&
        (HalfPortConfig->StartPin <= GPIO_PIN15) &&
        (HalfPortConfig->Mode <= GPIO_OUTPUT) &&
        (HalfPortConfig->Otype <= GPIO_OPEN_DRAIN) &&
        (HalfPortConfig->Speed <= GPIO_VERY_HIGH_SPEED) &&
        (HalfPortConfig->PullType <= GPIO_PULL_DOWN))
    {
      Local_u8CopyStartPin = HalfPortConfig->StartPin;
      /* Configure the 8 pins */
      for (Local_u8Counter = GPIO_PIN0; Local_u8Counter <= GPIO_PIN7; Local_u8Counter++)
      {
        HalfPortConfig->StartPin = Local_u8Counter;
        GPIO_enumPinInit((GPIO_PinConfig_t *)HalfPortConfig); //Error when casting removed
      }
      HalfPortConfig->StartPin = Local_u8CopyStartPin;
      UNUSED(Local_u8CopyStartPin);
      UNUSED(Local_u8Counter);
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
/*
 * @brief Initializes GPIO pin configuration
 * @param PinConfig[in]: Pointer to pin configuration structure
 * @retval GPIO_ErrorState GPIO_OK if successful, GPIO_NOK if error
 */
ErrorState_t GPIO_enumPortInit(GPIO_PortConfig_t *PortConfig)
{
  ErrorState_t Local_u8ErrorState = OK;
  uint8_t      Local_u8Counter;
  uint8_t      Local_u8CopyStartPin;

  if (PortConfig != NULL)
  { /* Check if port and configuration parameters are valid */
    if ((PortConfig->Port <= GPIO_PORTH) &&
        (PortConfig->StartPin <= GPIO_PIN15) &&
        (PortConfig->Mode <= GPIO_OUTPUT) &&
        (PortConfig->Otype <= GPIO_OPEN_DRAIN) &&
        (PortConfig->Speed <= GPIO_VERY_HIGH_SPEED) &&
        (PortConfig->PullType <= GPIO_PULL_DOWN))
    {
      Local_u8CopyStartPin = PortConfig->StartPin;
      /* Configure the 8 pins */
      for (Local_u8Counter = GPIO_PIN0; Local_u8Counter <= GPIO_PIN15; Local_u8Counter++)
      {
        PortConfig->StartPin = Local_u8Counter;
        GPIO_enumPinInit((GPIO_PinConfig_t *)PortConfig); //Error when casting removed
      }
      PortConfig->StartPin = Local_u8CopyStartPin;
      UNUSED(Local_u8CopyStartPin);
      UNUSED(Local_u8Counter);
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}

/*=================================================================================================================*/
/*
 * @brief Initializes GPIO port 8-pins configuration
 * @param GPIO_8BinsConfig[in]: Pointer to port 8-pins configuration structure containing:
 *                      - Port: Selected GPIO port (PORTA to PORTH)
 *                      - StartPin: Starting pin number (PIN0 to PIN8)
 *                      - Mode: Port mode (INPUT, OUTPUT)
 *                      - Otype: Output type (PUSH_PULL, OPEN_DRAIN)
 *                      - Speed: Output speed (LOW_SPEED, MEDIUM_SPEED, HIGH_SPEED, VERY_HIGH_SPEED)
 *                      - PullType: Pull-up/Pull-down configuration (NO_PULL, PULL_UP, PULL_DOWN)
 * @retval ErrorState_t OK if configuration successful, NOK if invalid parameters, NULL_POINTER if invalid pointer
 */
ErrorState_t GPIO_enumPort8PinsInit(GPIO_8PinsConfig_t *GPIO_8PinsConfig)
{
  ErrorState_t Local_u8ErrorState = OK;
  uint8_t      Local_u8Counter;
  uint8_t      Local_u8EndPin;
  uint8_t      Local_u8CopyStartPin;

  if (GPIO_8PinsConfig != NULL)
  { /* Check if port and configuration parameters are valid */
    if ((GPIO_8PinsConfig->Port <= GPIO_PORTH) &&
        (GPIO_8PinsConfig->StartPin <= GPIO_PIN15) &&
        (GPIO_8PinsConfig->Mode <= GPIO_OUTPUT) &&
        (GPIO_8PinsConfig->Otype <= GPIO_OPEN_DRAIN) &&
        (GPIO_8PinsConfig->Speed <= GPIO_VERY_HIGH_SPEED) &&
        (GPIO_8PinsConfig->PullType <= GPIO_PULL_DOWN))
    {
      Local_u8EndPin = GPIO_8PinsConfig->StartPin + 7;
      Local_u8CopyStartPin = GPIO_8PinsConfig->StartPin;
      /* Configure the 8 pins */
      for (Local_u8Counter = Local_u8CopyStartPin; Local_u8Counter <= Local_u8EndPin; Local_u8Counter++)
      {
        GPIO_8PinsConfig->StartPin = Local_u8Counter;
        GPIO_enumPinInit((GPIO_PinConfig_t *)GPIO_8PinsConfig); //Error when casting removed
      }
      GPIO_8PinsConfig->StartPin = Local_u8CopyStartPin;
      UNUSED(Local_u8CopyStartPin);
      UNUSED(Local_u8EndPin);
      UNUSED(Local_u8Counter);
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}

