abdallah-shehawey/V2X-Collision-Avoidance/V2V-STM32/Src/GPIO_prog.c
/*=================================================================================================================*/
/*
 * @brief Initializes GPIO port 4-pins configuration
 * @param Port4PinsConfig[in]: Pointer to port 4-pins configuration structure containing:
 *                      - Port: Selected GPIO port (PORTA to PORTH)
 *                      - StartPin: Starting pin number (PIN0 to PIN15)
 *                      - Mode: Port mode (INPUT, OUTPUT)
 *                      - Otype: Output type (PUSH_PULL, OPEN_DRAIN)
 *                      - Speed: Output speed (LOW_SPEED, MEDIUM_SPEED, HIGH_SPEED, VERY_HIGH_SPEED)
 *                      - PullType: Pull-up/Pull-down configuration (NO_PULL, PULL_UP, PULL_DOWN)
 * @retval ErrorState_t OK if configuration successful, NOK if invalid parameters, NULL_POINTER if invalid pointer
 */
ErrorState_t GPIO_enumPort4PinsInit(GPIO_4PinsConfig_t *GPIO_4PinsConfig)
{
  ErrorState_t Local_u8ErrorState = OK;
  uint8_t      Local_u8Counter;
  uint8_t      Local_u8EndPin;
  uint8_t      Local_u8CopyStartPin;

  if (GPIO_4PinsConfig != NULL)
  { /* Check if port and configuration parameters are valid */
    if ((GPIO_4PinsConfig->Port <= GPIO_PORTH) &&
        (GPIO_4PinsConfig->StartPin <= GPIO_PIN15) &&
        (GPIO_4PinsConfig->Mode <= GPIO_OUTPUT) &&
        (GPIO_4PinsConfig->Otype <= GPIO_OPEN_DRAIN) &&
        (GPIO_4PinsConfig->Speed <= GPIO_VERY_HIGH_SPEED) &&
        (GPIO_4PinsConfig->PullType <= GPIO_PULL_DOWN))
    {
      Local_u8EndPin = GPIO_4PinsConfig->StartPin + 3;
      Local_u8CopyStartPin = GPIO_4PinsConfig->StartPin;
      /* Configure the 4 pins */
      for (Local_u8Counter = Local_u8CopyStartPin; Local_u8Counter <= Local_u8EndPin; Local_u8Counter++)
      {
        GPIO_4PinsConfig->StartPin = Local_u8Counter;
        GPIO_enumPinInit((GPIO_PinConfig_t *)GPIO_4PinsConfig);
      }
      GPIO_4PinsConfig->StartPin = Local_u8CopyStartPin;
      UNUSED(Local_u8CopyStartPin);
      UNUSED(Local_u8EndPin);
      UNUSED(Local_u8Counter);
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}

/*=================================================================================================================*/
/*
 * @brief Write 4 bits directly to ODR register starting from specified pin
 * @param Port GPIO port index (PORTA to PORTH)
 * @param StartPin Starting pin number (PIN0 to PIN12)
 * @param Value 4-bit value to write (0x0 to 0xF)
 * @retval ErrorState_t OK if write successful, NOK if invalid parameters
 */
ErrorState_t GPIO_enumWrite4PinsVal(GPIO_Port_t Port, GPIO_Pin_t StartPin, uint8_t Value)
{
  ErrorState_t Local_u8ErrorState = OK;

  if ((Port <= GPIO_PORTH) && (StartPin <= GPIO_PIN15) && (Value <= 0x0F))
  {
    // Clear the 4 bits
    GPIO_Port[Port]->ODR &= ~(0x0F << StartPin);
    // Write the new value
    GPIO_Port[Port]->ODR |= ((Value & 0x0F) << StartPin);
  }
  else
  {
    Local_u8ErrorState = NOK;
  }
  return Local_u8ErrorState;
}

/*=================================================================================================================*/
/*
 * @brief Write 8 bits directly to ODR register starting from specified pin
 * @param Port GPIO port index (PORTA to PORTH)
 * @param StartPin Starting pin number (PIN0 to PIN15)
 * @param Value 8-bit value to write (0x00 to 0xFF)
 * @retval ErrorState_t OK if write successful, NOK if invalid parameters
 */
ErrorState_t GPIO_enumWrite8PinsVal(GPIO_Port_t Port, GPIO_Pin_t StartPin, uint8_t Value)
{
  ErrorState_t Local_u8ErrorState = OK;

  if ((Port <= GPIO_PORTH) && (StartPin <= GPIO_PIN8) && (Value <= 0xFF))
  {
    GPIO_Port[Port]->ODR &= ~(0xFF << StartPin);
    GPIO_Port[Port]->ODR |= ((Value & 0xFF) << StartPin);
  }
  else
  {
    Local_u8ErrorState = NOK;
  }
  return Local_u8ErrorState;
}

/*=================================================================================================================*/
/*
 * @brief Write a value to a specific GPIO pin using array-based port access
 * @param Port GPIO port index (PORTA to PORTH)
 * @param PinNum Selected pin number (PIN0 to PIN15)
 * @param PinVal Value to write (PIN_LOW or PIN_HIGH)
 * @retval ErrorState_t OK if write successful, NOK if invalid parameters
 */
ErrorState_t GPIO_enumWritePinVal(GPIO_Port_t Port, GPIO_Pin_t PinNum, GPIO_PinValue_t PinVal)
{
  ErrorState_t Local_u8ErrorState = OK;

  /* Check if port and pin numbers are valid */
  if ((Port <= GPIO_PORTH) && (PinNum <= GPIO_PIN15) && (PinVal == GPIO_PIN_HIGH || PinVal == GPIO_PIN_LOW))
  {
    /* Write the value to the pin using BSRR register for atomic access */
    switch (PinVal)
    {
    case GPIO_PIN_HIGH:
      GPIO_Port[Port]->BSRR = (1u << PinNum); /* Set bits are in the low half of BSRR */
      /*GPIO_Port[Port]->ODR |= (1u << PinNum);*/
      break;
    case GPIO_PIN_LOW:
      GPIO_Port[Port]->BSRR = (1u << (PinNum + 16u)); /* Reset bits are in the high half of BSRR */
      /*GPIO_Port[Port]->ODR &= ~(1u << PinNum);*/
      break;
    default:
      Local_u8ErrorState = NOK;
      break;
    }
  }
  else
  {
    Local_u8ErrorState = NOK;
  }
  return Local_u8ErrorState;
}

/*=================================================================================================================*/
/*
 * @brief Read the current value of a specific GPIO pin using array-based port access
 * @param Port GPIO port index (PORTA to PORTH)
 * @param PinNum Selected pin number (PIN0 to PIN15)
 * @param PinVal Pointer to store the read value (PIN_LOW or PIN_HIGH)
 * @retval ErrorState_t OK if read successful, NOK if invalid parameters
 */
ErrorState_t GPIO_enumReadPinVal(GPIO_Port_t Port, GPIO_Pin_t PinNum, GPIO_PinValue_t *PinVal)
{
  ErrorState_t Local_u8ErrorState = OK;
  if (PinVal != NULL)
  {
    /* Check if port and pin numbers are valid and PinVal pointer is not NULL */
    if ((Port <= GPIO_PORTH) && (PinNum <= GPIO_PIN15))
    {
      /* Read the pin value by checking the corresponding bit in IDR register */
      *PinVal = (GPIO_Port[Port]->IDR & (1u << PinNum)) ? GPIO_PIN_HIGH : GPIO_PIN_LOW;
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}

