abdallah-shehawey/V2X-Collision-Avoidance/V2V-STM32/Src/GPIO_prog.c
/*=================================================================================================================*/
/*
 * @brief Toggle the current value of a specific GPIO pin using array-based port access
 * @param Port GPIO port index (PORTA to PORTH)
 * @param PinNum Selected pin number (PIN0 to PIN15)
 * @retval ErrorState_t OK if toggle successful, NOK if invalid parameters
 */
ErrorState_t GPIO_enumTogPinVal(GPIO_Port_t Port, GPIO_Pin_t PinNum)
{
  ErrorState_t Local_u8ErrorState = OK;

  /* Check if port and pin numbers are valid */
  if ((Port >= GPIO_PORTA && Port <= GPIO_PORTH) && (PinNum >= GPIO_PIN0 && PinNum <= GPIO_PIN15))
  {
    GPIO_Port[Port]->ODR ^= (1 << PinNum);
  }
  else
  {
    Local_u8ErrorState = NOK;
  }
  return Local_u8ErrorState;
}

/*=================================================================================================================*/
/*
 * @brief Read the current value of a GPIO port 4-pins
 * @param Port GPIO port (PORTA to PORTH)
 * @param StartPin Starting pin number (PIN0 to PIN15)
 * @param PinsValue Pointer to store the read value
 * @retval ErrorState_t OK if configuration successful, NOK if invalid parameters, NULL_POINTER if invalid pointer
 */
ErrorState_t GPIO_enumRead4PinsVal(GPIO_Port_t Port, GPIO_Pin_t StartPin, uint8_t *PinsValue)
{
  ErrorState_t Local_u8ErrorState = OK;
  if (PinsValue != NULL)
  {
    if ((Port <= GPIO_PORTH) && (StartPin <= GPIO_PIN15))
    {
      *PinsValue = (GPIO_Port[Port]->IDR & (0x0F << StartPin));
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}

/*=================================================================================================================*/
/*
 * @brief Read the current value of a GPIO port 8-pins
 * @param Port GPIO port (PORTA to PORTH)
 * @param StartPin Starting pin number (PIN0 to PIN15)
 * @param PinsValue Pointer to store the read value
 * @retval ErrorState_t OK if configuration successful, NOK if invalid parameters, NULL_POINTER if invalid pointer
 */
ErrorState_t GPIO_enumRead8PinsVal(GPIO_Port_t Port, GPIO_Pin_t StartPin, uint8_t *PinsValue)
{
  ErrorState_t Local_u8ErrorState = OK;
  if (PinsValue != NULL)
  {
    if ((Port <= GPIO_PORTH) && (StartPin <= GPIO_PIN15))
    {
      *PinsValue = (GPIO_Port[Port]->IDR & (0xFF << StartPin));
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
/*
 * @brief Write the current value of a GPIO port low nibble
 * @param port GPIO port (PORTA to PORTH)
 * @param Copy_u8Val Value to write
 * @param PinsVal Value to write
 * @retval ErrorState_t OK if configuration successful, NOK if invalid parameters, NULL_POINTER if invalid pointer
 */
ErrorState_t GPIO_enumWriteLowNibbleVal(GPIO_Port_t port, uint8_t Copy_u8Val, GPIO_PinValue_t PinsVal)
{
  ErrorState_t Local_u8ErrorState = OK;
  if (PinsVal > GPIO_PIN_HIGH || PinsVal < GPIO_PIN_LOW)
  {
    Local_u8ErrorState = NOK;
  }
  else
  {
    if (PinsVal == GPIO_PIN_HIGH)
    {
      Copy_u8Val &= 0x0F;
      GPIO_Port[port]->BSRR = Copy_u8Val;
    }
    else if (PinsVal == GPIO_PIN_LOW)
    {
      Copy_u8Val &= 0x0F;
      GPIO_Port[port]->BSRR = Copy_u8Val << 16;
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
/*
 * @brief Write the current value of a GPIO port high nibble
 * @param port GPIO port (PORTA to PORTH)
 * @param Copy_u8Val Value to write
 * @param PinsVal Value to write
 * @retval ErrorState_t OK if configuration successful, NOK if invalid parameters, NULL_POINTER if invalid pointer
 */
ErrorState_t GPIO_enumWriteHighNibbleVal(GPIO_Port_t port, uint8_t Copy_u8Val, GPIO_PinValue_t PinsVal)
{
  ErrorState_t Local_u8ErrorState = OK;
  if (PinsVal > GPIO_PIN_HIGH || PinsVal < GPIO_PIN_LOW)
  {
    Local_u8ErrorState = NOK;
  }
  else
  {
    if (PinsVal == GPIO_PIN_HIGH)
    {
      Copy_u8Val &= 0xF0;
      GPIO_Port[port]->BSRR = Copy_u8Val;
    }
    else if (PinsVal == GPIO_PIN_LOW)
    {
      Copy_u8Val &= 0xF0;
      GPIO_Port[port]->BSRR = Copy_u8Val << 16;
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
/*
 * @brief Write the current value of a GPIO port byte
 * @param port GPIO port (PORTA to PORTH)
 * @param Copy_u8Val Value to write
 * @param PinsVal Value to write
 * @retval ErrorState_t OK if configuration successful, NOK if invalid parameters, NULL_POINTER if invalid pointer
 */
ErrorState_t GPIO_enumWriteByteVal(GPIO_Port_t port, uint8_t Copy_u8Val, GPIO_PinValue_t PinsVal)
{
  ErrorState_t Local_u8ErrorState = OK;
  if (PinsVal > GPIO_PIN_HIGH || PinsVal < GPIO_PIN_LOW)
  {
    Local_u8ErrorState = NOK;
  }
  else
  {
    if (PinsVal == GPIO_PIN_HIGH)
    {
      Copy_u8Val &= 0xFF;
      GPIO_Port[port]->BSRR = Copy_u8Val;
    }
    else if (PinsVal == GPIO_PIN_LOW)
    {
      Copy_u8Val &= 0xFF;
      GPIO_Port[port]->BSRR = Copy_u8Val << 16;
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
/*
 * @brief Write the current value of a GPIO port half word
 * @param port GPIO port (PORTA to PORTH)
 * @param Copy_u8Val Value to write
 * @param PinsVal Value to write
 * @retval ErrorState_t OK if configuration successful, NOK if invalid parameters, NULL_POINTER if invalid pointer
 */
ErrorState_t GPIO_enumWriteHalfWordVal(GPIO_Port_t port, uint16_t Copy_u16Val, GPIO_PinValue_t PinsVal)
{
  ErrorState_t Local_u8ErrorState = OK;
  if (PinsVal > GPIO_PIN_HIGH || PinsVal < GPIO_PIN_LOW)
  {
    Local_u8ErrorState = NOK;
  }
  else
  {
    if (PinsVal == GPIO_PIN_HIGH)
    {
      Copy_u16Val &= 0xFFFF;
      GPIO_Port[port]->BSRR = Copy_u16Val;
    }
    else if (PinsVal == GPIO_PIN_LOW)
    {
      Copy_u16Val &= 0xFFFF;
      GPIO_Port[port]->BSRR = Copy_u16Val << 16;
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
/*
 * @brief Write the current value of a GPIO port word
 * @param port GPIO port (PORTA to PORTH)
 * @param Copy_u8Val Value to write
 * @param PinsVal Value to write
 * @retval ErrorState_t OK if configuration successful, NOK if invalid parameters, NULL_POINTER if invalid pointer
 */
ErrorState_t GPIO_enumWritePortVal(GPIO_Port_t port, uint16_t Copy_u16Val, GPIO_PinValue_t PinsVal)
{
  ErrorState_t Local_u8ErrorState = OK;
  if (PinsVal > GPIO_PIN_HIGH || PinsVal < GPIO_PIN_LOW)
  {
    Local_u8ErrorState = NOK;
  }
  else
  {
    if (PinsVal == GPIO_PIN_HIGH)
    {
      Copy_u16Val &= 0xFFFF;
      GPIO_Port[port]->BSRR = Copy_u16Val;
    }
    else if (PinsVal == GPIO_PIN_LOW)
    {
      Copy_u16Val &= 0xFFFF;
      GPIO_Port[port]->BSRR = Copy_u16Val << 16;
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
/*
 * @brief Read the current value of a GPIO port low nibble
 * @param port GPIO port (PORTA to PORTH)
 * @param Copy_u8Val Value to write
 * @param PinsVal Value to write
 * @retval ErrorState_t OK if configuration successful, NOK if invalid parameters, NULL_POINTER if invalid pointer
 */
ErrorState_t GPIO_enumReadLowNibbleVal(GPIO_Port_t port, uint8_t *LowNibbleVal)
{
  ErrorState_t Local_u8ErrorState = OK;
  if (LowNibbleVal != NULL)
  {
    if (port <= GPIO_PORTH)
    {
      *LowNibbleVal = (GPIO_Port[port]->IDR & 0x0F);
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
/*
 * @brief Read the current value of a GPIO port high nibble
 * @param port GPIO port (PORTA to PORTH)
 * @param HighNibbleVal Pointer to store the read value
 * @retval ErrorState_t OK if configuration successful, NOK if invalid parameters, NULL_POINTER if invalid pointer
 */
ErrorState_t GPIO_enumReadHighNibbleVal(GPIO_Port_t port, uint8_t *HighNibbleVal)
{
  ErrorState_t Local_u8ErrorState = OK;
  if (HighNibbleVal != NULL)
  {
    if (port <= GPIO_PORTH)
    {
      *HighNibbleVal = (GPIO_Port[port]->IDR & 0xF0);
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
/*
 * @brief Read the current value of a GPIO port byte
 * @param port GPIO port (PORTA to PORTH)
 * @param ByteVal Pointer to store the read value
 * @retval ErrorState_t OK if configuration successful, NOK if invalid parameters, NULL_POINTER if invalid pointer
 */
ErrorState_t GPIO_enumReadByteVal(GPIO_Port_t port, uint8_t *ByteVal)
{
  ErrorState_t Local_u8ErrorState = OK;
  if (ByteVal != NULL)
  {
    if (port <= GPIO_PORTH)
    {
      *ByteVal = (GPIO_Port[port]->IDR & 0xFF);
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
/*
 * @brief Read the current value of a GPIO port half word
 * @param port GPIO port (PORTA to PORTH)
 * @param HalfPortVal Pointer to store the read value
 * @retval ErrorState_t OK if configuration successful, NOK if invalid parameters, NULL_POINTER if invalid pointer
 */
ErrorState_t GPIO_enumReadHalfPortVal(GPIO_Port_t port, uint16_t *HalfPortVal)
{
  ErrorState_t Local_u8ErrorState = OK;
  if (HalfPortVal != NULL)
  {
    if (port <= GPIO_PORTH)
    {
      *HalfPortVal = (GPIO_Port[port]->IDR & 0xFFFF);
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
/*
 * @brief Read the current value of a GPIO port word
 * @param port GPIO port (PORTA to PORTH)
 * @param PortVal Pointer to store the read value
 * @retval ErrorState_t OK if configuration successful, NOK if invalid parameters, NULL_POINTER if invalid pointer
 */
ErrorState_t GPIO_enumReadPortVal(GPIO_Port_t port, uint32_t *PortVal)
{
  ErrorState_t Local_u8ErrorState = OK;
  if (PortVal != NULL)
  {
    if (port <= GPIO_PORTH)
    {
      *PortVal = (GPIO_Port[port]->IDR & 0xFFFFFFFF);
    }
    else
    {
      Local_u8ErrorState = NOK;
    }
  }
  else
  {
    Local_u8ErrorState = NULL_POINTER;
  }
  return Local_u8ErrorState;
}
/*=================================================================================================================*/
